GHB2/src/InformationRegisters/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СвойстваПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтроения</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПомещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>CatalogRef.гхб_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНаГенеральномПлане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступВПомещениеПоКлючу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОхраннойСигнализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерКТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеКТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеДоступаСВысшимРуководителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщегоПользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает массив доступных локаций, для которых документом "гхб_СвойстваПомещений" установлен признак использования для парковок
// Параметры:
//		Нет параметров
//
Функция ВернутьДоступныеЛокацииДляПарковок() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.СрезПоследних КАК гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |		ПО гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.Локация = гхб_СвойстваПомещенийСрезПоследних.Помещение
	               |ГДЕ
	               |	гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.ИспользоватьДляЗакрепленияПарковочныхМест
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
